In [1]:
import pandas as pd
import numpy as np #For future use

In [2]:
my_series=pd.Series([1,2,34,45,"Dog"],index=["a","b","c","d","e"])
my_series

a      1
b      2
c     34
d     45
e    Dog
dtype: object

In [3]:
my_series[0]

1

In [4]:
my_series[1]

2

In [5]:
my_series[2]

34

In [6]:
my_series[3]

45

In [7]:
my_series[4]

'Dog'

In [8]:
my_series["a"]

1

In [9]:
my_series["b"]

2

In [10]:
my_series["c"]

34

In [11]:
my_series["d"]

45

In [12]:
my_series["e"]

'Dog'

In [13]:
d={"Name":["Sam","Laki","Rosa","Mahesh"],"Age":[21,34,35,67]}
df0=pd.DataFrame(d)
df0

     Name  Age
0     Sam   21
1    Laki   34
2    Rosa   35
3  Mahesh   67

In [19]:
arr0=np.array([[34,45],[56,66],[87,89]])
df=pd.DataFrame(arr0,columns=["col1","col2"])
df

   col1  col2
0    34    45
1    56    66
2    87    89

In [24]:
df_7=pd.read_csv("D:\Workshops\Python & R for Data Science Workshop\Python\Datasets\iris.csv")

In [25]:
df_7

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0    1001           5.1          3.5           1.4          0.2     setosa
1    1002           4.9          3.0           1.4          0.2     setosa
2    1003           4.7          3.2           1.3          0.2     setosa
3    1004           4.6          3.1           1.5          0.2     setosa
4    1005           5.0          3.6           1.4          0.2     setosa
..    ...           ...          ...           ...          ...        ...
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

[150 rows x 6 columns]

In [26]:
type(df_7)

pandas.core.frame.DataFrame

In [34]:
df=pd.DataFrame({"A":np.random.randint(1,200,300),"B":np.random.randint(1,200,300)})
df

       A    B
0     19   91
1    134  109
2    145  187
3     12  127
4    168  195
..   ...  ...
295  146  101
296  153  185
297  162  125
298   73  108
299  103  129

[300 rows x 2 columns]

In [41]:
df_7=pd.DataFrame({"A":np.random.randint(1,200,300.567),"B":np.random.randint(1,200,400)})
df_7

TypeError: 'float' object cannot be interpreted as an integer

In [42]:
df_7=pd.DataFrame({"A":np.random.randint(1,200,400),"B":np.random.randint(1,200,400)})
df_7

       A    B
0     80   42
1    182   88
2     23  170
3     66  112
4     50  161
..   ...  ...
395  195   83
396  113  130
397   66  126
398   51   72
399  195  120

[400 rows x 2 columns]

In [43]:
df_7.head()

     A    B
0   80   42
1  182   88
2   23  170
3   66  112
4   50  161

In [44]:
df_7.tail()

       A    B
395  195   83
396  113  130
397   66  126
398   51   72
399  195  120

In [45]:
df.head(10)

     A    B
0   19   91
1  134  109
2  145  187
3   12  127
4  168  195
5   61   60
6   60    9
7   29   18
8   99  153
9   64   64

In [46]:
df_7.head(10)

     A    B
0   80   42
1  182   88
2   23  170
3   66  112
4   50  161
5  109  168
6  147  157
7   37  118
8   79  191
9   23  161

In [47]:
df.head(10)

     A    B
0   19   91
1  134  109
2  145  187
3   12  127
4  168  195
5   61   60
6   60    9
7   29   18
8   99  153
9   64   64

In [48]:
df_7.head(10)

     A    B
0   80   42
1  182   88
2   23  170
3   66  112
4   50  161
5  109  168
6  147  157
7   37  118
8   79  191
9   23  161

In [49]:
df.tail(10)

       A    B
290  140   42
291   93   74
292   86   48
293  195  122
294  131  106
295  146  101
296  153  185
297  162  125
298   73  108
299  103  129

In [50]:
df_7.tail(10)

       A    B
390   48   40
391   66  181
392  180   28
393  190  122
394  154  196
395  195   83
396  113  130
397   66  126
398   51   72
399  195  120

In [51]:
df.tail(-10)

       A    B
10   143  163
11    15  176
12   128  187
13   138   10
14    37  135
..   ...  ...
295  146  101
296  153  185
297  162  125
298   73  108
299  103  129

[290 rows x 2 columns]

In [52]:
df_7.tail(-10)

       A    B
10   199   47
11    62    9
12    23  153
13     8  180
14   142   50
..   ...  ...
395  195   83
396  113  130
397   66  126
398   51   72
399  195  120

[390 rows x 2 columns]

In [53]:
df.head(-10)

       A    B
0     19   91
1    134  109
2    145  187
3     12  127
4    168  195
..   ...  ...
285   77  156
286   19  160
287   96   36
288   91   85
289   75  153

[290 rows x 2 columns]

In [54]:
df_7.head(-10)

       A    B
0     80   42
1    182   88
2     23  170
3     66  112
4     50  161
..   ...  ...
385   10    2
386   66   94
387  103   39
388   22  137
389   18   13

[390 rows x 2 columns]

In [55]:
df.shape

(300, 2)

In [56]:
df.index

RangeIndex(start=0, stop=300, step=1)

In [57]:
df_7.index

RangeIndex(start=0, stop=400, step=1)

In [58]:
df.columns

Index(['A', 'B'], dtype='object')

In [59]:
df_7.columns

Index(['A', 'B'], dtype='object')

In [60]:
df_7.shape

(400, 2)

In [61]:
len(df)

300

In [62]:
len(df_7)

400

In [63]:
df_7=pd.read_excel("D:\Workshops\Python & R for Data Science Workshop\Python\Datasets\iris.XLSX")

In [65]:
df_7.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [66]:
hf=pd.ExcelFile("D:\Workshops\Python & R for Data Science Workshop\Python\Datasets\iris.XLSX")

In [67]:
hf.sheet_names

['iris', 'marks']

In [68]:
hf.sheet_names[0]

'iris'

In [69]:
hf.sheet_names[1]

'marks'

In [71]:
df_7=hf.parse(hf.sheet_names[1])

In [73]:
df_7

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [74]:
df0=pd.DataFrame({"col1":[12,34,56,67],"col2":[56,67,78,89],"col3":[56,78,32,54]})
df0

   col1  col2  col3
0    12    56    56
1    34    67    78
2    56    78    32
3    67    89    54

In [79]:
df0["col4"]=[67,78,89,90]

In [80]:
df0

   col1  col2  col3  Col4  col4
0    12    56    56    67    67
1    34    67    78    78    78
2    56    78    32    89    89
3    67    89    54    90    90

In [81]:
df0.columns

Index(['col1', 'col2', 'col3', 'Col4', 'col4'], dtype='object')

In [82]:
df0.index

RangeIndex(start=0, stop=4, step=1)

In [84]:
df0["col1"]

0    12
1    34
2    56
3    67
Name: col1, dtype: int64

In [85]:
df0["col2"]

0    56
1    67
2    78
3    89
Name: col2, dtype: int64

In [86]:
df0["col3"]

0    56
1    78
2    32
3    54
Name: col3, dtype: int64

In [87]:
df0["col4"]

0    67
1    78
2    89
3    90
Name: col4, dtype: int64

In [89]:
type(df0["col1"])

pandas.core.series.Series

In [90]:
type(df0["col2"])

pandas.core.series.Series

In [91]:
type(df0["col3"])

pandas.core.series.Series

In [92]:
type(df0["col4"])

pandas.core.series.Series

In [93]:
df0["col1"][0]

12

In [94]:
df0["col2"][1]

67

In [95]:
df0["col3"][2]

32

In [96]:
df0["col4"][3]

90

In [99]:
df0["col4"][-1]

KeyError: -1

In [100]:
df0.iloc[1,0]

34

In [101]:
df0.iloc[2,0]

56

In [102]:
df0.iloc[3,0]

67

In [104]:
df0.iloc[0,1]

56

In [105]:
df0.iloc[0,2]

56

In [106]:
df0.iloc[0,3]

67

In [107]:
df0.iat[2,0]

56

In [108]:
df0.iat[1,0]

34

In [109]:
df0.iat[3,0]

67

In [110]:
df0.at[1,0]

KeyError: 0

In [111]:
df0.loc[0]

col1    12
col2    56
col3    56
Col4    67
col4    67
Name: 0, dtype: int64

In [112]:
df0.loc[1]

col1    34
col2    67
col3    78
Col4    78
col4    78
Name: 1, dtype: int64

In [113]:
df0.loc[2]

col1    56
col2    78
col3    32
Col4    89
col4    89
Name: 2, dtype: int64

In [114]:
df0.loc[3]

col1    67
col2    89
col3    54
Col4    90
col4    90
Name: 3, dtype: int64

In [116]:
df0.at[0]

TypeError: _get_value() missing 1 required positional argument: 'col'

In [117]:
df0.iloc[1:4,:2]

   col1  col2
1    34    67
2    56    78
3    67    89

In [118]:
df0.iloc[0:3,:0]

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [119]:
df0.iloc[1:2,:1]

   col1
1    34

In [120]:
df0.at[0:2,:3]

TypeError: unhashable type: 'slice'

In [125]:
df0["col3"]=["A" if i>=50 else "B" for i in df0["col2"]]

In [126]:
df0

   col1  col2 col3  Col4  col4
0    12    56    A    67    67
1    34    67    A    78    78
2    56    78    A    89    89
3    67    89    A    90    90

In [127]:
df0["col1"]>=df0["col2"]

0    False
1    False
2    False
3    False
dtype: bool

In [128]:
df0["col2"]>=df0["col4"]

0    False
1    False
2    False
3    False
dtype: bool

In [135]:
df0["col1"]<=df0["col2"]

0    True
1    True
2    True
3    True
dtype: bool

In [136]:
df0["col2"]<=df0["col4"]

0    True
1    True
2    True
3    True
dtype: bool

In [143]:
data=np.arange(8).reshape(4,2)
df0=pd.DataFrame(data,columns=["col1","col2"])
df0

   col1  col2
0     0     1
1     2     3
2     4     5
3     6     7

In [144]:
df0.apply(sum,axis=0)

col1    12
col2    16
dtype: int64

In [145]:
df0.apply(sum,axis=1)

0     1
1     5
2     9
3    13
dtype: int64

In [146]:
df0.apply(sum,axis=2)

ValueError: No axis named 2 for object type DataFrame

In [148]:
fun_7=lambda L:L[0]*L[-1]

In [149]:
fun_7([3,4,7,10,14,25,30])

90

In [154]:
df0.apply(fun_7,axis=1)

0     0
1     6
2    20
3    42
dtype: int64

In [155]:
fun_7=lambda x:2*x

In [156]:
df0["col1"].map(fun_7)

0     0
1     4
2     8
3    12
Name: col1, dtype: int64

In [157]:
df0["col2"].map(fun_7)

0     2
1     6
2    10
3    14
Name: col2, dtype: int64

In [160]:
df0=pd.DataFrame({"A":np.random.randint(1,25,78),"B":np.random.uniform(1,25,78)})
df0

     A          B
0    9  18.703475
1    1   9.554201
2   18  19.770069
3    3  21.447163
4   15  16.880339
..  ..        ...
73  16  15.435491
74  10  10.652286
75  12   6.349777
76   5  20.007505
77  12  20.723583

[78 rows x 2 columns]

In [161]:
df0["B"]=df0["B"].map(int)

In [162]:
df0

     A   B
0    9  18
1    1   9
2   18  19
3    3  21
4   15  16
..  ..  ..
73  16  15
74  10  10
75  12   6
76   5  20
77  12  20

[78 rows x 2 columns]

In [165]:
df0=pd.DataFrame({"Name":["A","B","C","D","E"],"Age":[23,33,21,35,23],"Result":["Pass","Fail","Pass","Pass","Fail"]})
df0

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail

In [168]:
df0["Result"]=="Pass"

0     True
1    False
2     True
3     True
4    False
Name: Result, dtype: bool

In [169]:
df0["Result"]=="Fail"

0    False
1     True
2    False
3    False
4     True
Name: Result, dtype: bool

In [170]:
df0[df0["Result"]=="Pass"]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [171]:
df0[df0["Result"]=="Fail"]

  Name  Age Result
1    B   33   Fail
4    E   23   Fail

In [172]:
df0[(df0["Result"]=="Fail") | (df0["Age"]>=30)]

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
4    E   23   Fail

In [173]:
df0[(df0["Result"]=="Fail") | (df0["Age"]<=30)]

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
4    E   23   Fail

In [174]:
df0[(df0["Result"]=="Pass") | (df0["Age"]>=30)]

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass

In [175]:
df0[(df0["Result"]=="Pass") | (df0["Age"]<=30)]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail

In [176]:
df0.min(axis=0)

Name         A
Age         21
Result    Fail
dtype: object

In [177]:
df0.max(axis=1)

0    23
1    33
2    21
3    35
4    23
dtype: int64

In [178]:
df0.mean(axis=0)

Age    27.0
dtype: float64

In [179]:
df0.mean(axis=1)

0    23.0
1    33.0
2    21.0
3    35.0
4    23.0
dtype: float64

In [180]:
df0.median(axis=0)

Age    23.0
dtype: float64

In [181]:
df0.median(axis=1)

0    23.0
1    33.0
2    21.0
3    35.0
4    23.0
dtype: float64

In [182]:
df0.min()

Name         A
Age         21
Result    Fail
dtype: object

In [183]:
df0.max()

Name         E
Age         35
Result    Pass
dtype: object

In [184]:
df0.mean()

Age    27.0
dtype: float64

In [185]:
df0.median()

Age    23.0
dtype: float64